/*Задача 64: Задайте значения M и N. 
Напишите программу, которая выведет все 
натуральные числа в промежутке от M до N.
M = 1; N = 5. -> "1, 2, 3, 4, 5"
M = 4; N = 8. -> "4, 5, 6, 7, 8"
*/
int n = 15;
int m = 5;
void f(int n, int m)
{
    if(n != (m-1))
    {
        f(n - 1, m);
        Console.Write(n + " ");
    }
}
f(n,m);
